guides/cursor/baselines/gin_pprof_runs/k6_gin_20260618_011046.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: load_test_pprof.js
        output: -

     scenarios: (100.00%) 1 scenario, 24 max VUs, 45s max duration (incl. graceful stop):
              * steady: 24 looping VUs for 15s (gracefulStop: 30s)

time="2026-06-18T01:10:50+05:30" level=info msg="pprof load: 24 VUs × 15s, scenario=tagged_ecdsa" source=console

running (01.0s), 24/24 VUs, 722 complete and 0 interrupted iterations
steady   [   7% ] 24 VUs  01.0s/15s

running (02.0s), 24/24 VUs, 2036 complete and 0 interrupted iterations
steady   [  13% ] 24 VUs  02.0s/15s

running (03.0s), 24/24 VUs, 3369 complete and 0 interrupted iterations
steady   [  20% ] 24 VUs  03.0s/15s

running (04.0s), 24/24 VUs, 4786 complete and 0 interrupted iterations
steady   [  27% ] 24 VUs  04.0s/15s

running (05.0s), 24/24 VUs, 5908 complete and 0 interrupted iterations
steady   [  33% ] 24 VUs  05.0s/15s

running (06.0s), 24/24 VUs, 6790 complete and 0 interrupted iterations
steady   [  40% ] 24 VUs  06.0s/15s

running (07.0s), 24/24 VUs, 7444 complete and 0 interrupted iterations
steady   [  47% ] 24 VUs  07.0s/15s

running (08.0s), 24/24 VUs, 8274 complete and 0 interrupted iterations
steady   [  54% ] 24 VUs  08.1s/15s

running (09.0s), 24/24 VUs, 9159 complete and 0 interrupted iterations
steady   [  60% ] 24 VUs  09.0s/15s

running (10.0s), 24/24 VUs, 10188 complete and 0 interrupted iterations
steady   [  67% ] 24 VUs  10.0s/15s

running (11.0s), 24/24 VUs, 11201 complete and 0 interrupted iterations
steady   [  73% ] 24 VUs  11.0s/15s

running (12.0s), 24/24 VUs, 12444 complete and 0 interrupted iterations
steady   [  80% ] 24 VUs  12.0s/15s

running (13.0s), 24/24 VUs, 13619 complete and 0 interrupted iterations
steady   [  87% ] 24 VUs  13.0s/15s

running (14.0s), 24/24 VUs, 14629 complete and 0 interrupted iterations
steady   [  93% ] 24 VUs  14.0s/15s

running (15.0s), 24/24 VUs, 15676 complete and 0 interrupted iterations
steady   [ 100% ] 24 VUs  15.0s/15s
time="2026-06-18T01:11:05+05:30" level=info msg="pprof load done (started 2026-06-17T19:40:50.623Z)" source=console


  █ THRESHOLDS 

    errors
    ✓ 'rate<0.05' rate=0.00%

    http_req_duration
    ✓ 'p(99)<5000' p(99)=136.26ms

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 31436   2072.944043/s
    checks_succeeded...: 100.00% 31436 out of 31436
    checks_failed......: 0.00%   0 out of 31436

    ✓ status is 200
    ✓ response has content

    CUSTOM
    active_latency.................: avg=10.268511  min=2        med=7      max=186      p(90)=18.1    p(95)=25       p(99)=53      
    errors.........................: 0.00%  0 out of 15718
    hft_latency....................: avg=188.971466 min=77       med=179    max=588      p(90)=263     p(95)=291      p(99)=399.9   
    pdf_generation_time............: avg=16.594414  min=1        med=5      max=588      p(90)=21      p(95)=90.3     p(99)=228.83  
    retail_latency.................: avg=7.22418    min=1        med=4      max=207      p(90)=15      p(95)=21       p(99)=42      

    HTTP
    http_req_duration..............: avg=11.95ms    min=367.28µs med=4.62ms max=499.81ms p(90)=20.1ms  p(95)=54.99ms  p(99)=136.26ms
      { expected_response:true }...: avg=11.95ms    min=367.28µs med=4.62ms max=499.81ms p(90)=20.1ms  p(95)=54.99ms  p(99)=136.26ms
    http_req_failed................: 0.00%  0 out of 15719
    http_reqs......................: 15719  1036.537963/s

    EXECUTION
    iteration_duration.............: avg=22.96ms    min=1.57ms   med=6.71ms max=650.69ms p(90)=23.72ms p(95)=122.08ms p(99)=332.3ms 
    iterations.....................: 15718  1036.472022/s
    vus............................: 24     min=24         max=24
    vus_max........................: 24     min=24         max=24

    NETWORK
    data_received..................: 1.5 GB 99 MB/s
    data_sent......................: 1.0 GB 68 MB/s



running (15.2s), 00/24 VUs, 15718 complete and 0 interrupted iterations
steady ✓ [ 100% ] 24 VUs  15s