guides/cursor/baselines/gin_pprof_runs/k6_gin_20260618_011127.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: load_test_pprof.js
        output: -

     scenarios: (100.00%) 1 scenario, 24 max VUs, 45s max duration (incl. graceful stop):
              * steady: 24 looping VUs for 15s (gracefulStop: 30s)

time="2026-06-18T01:11:31+05:30" level=info msg="pprof load: 24 VUs × 15s, scenario=tagged_ecdsa" source=console

running (01.0s), 24/24 VUs, 1094 complete and 0 interrupted iterations
steady   [   7% ] 24 VUs  01.0s/15s

running (02.0s), 24/24 VUs, 2314 complete and 0 interrupted iterations
steady   [  13% ] 24 VUs  02.0s/15s

running (03.0s), 24/24 VUs, 3328 complete and 0 interrupted iterations
steady   [  20% ] 24 VUs  03.0s/15s

running (04.0s), 24/24 VUs, 4489 complete and 0 interrupted iterations
steady   [  27% ] 24 VUs  04.0s/15s

running (05.0s), 24/24 VUs, 5665 complete and 0 interrupted iterations
steady   [  33% ] 24 VUs  05.0s/15s

running (06.0s), 24/24 VUs, 6973 complete and 0 interrupted iterations
steady   [  40% ] 24 VUs  06.0s/15s

running (07.0s), 24/24 VUs, 8211 complete and 0 interrupted iterations
steady   [  47% ] 24 VUs  07.0s/15s

running (08.0s), 24/24 VUs, 9440 complete and 0 interrupted iterations
steady   [  53% ] 24 VUs  08.0s/15s

running (09.0s), 24/24 VUs, 10629 complete and 0 interrupted iterations
steady   [  60% ] 24 VUs  09.0s/15s

running (10.1s), 24/24 VUs, 11799 complete and 0 interrupted iterations
steady   [  67% ] 24 VUs  10.1s/15s

running (11.0s), 24/24 VUs, 12963 complete and 0 interrupted iterations
steady   [  73% ] 24 VUs  11.0s/15s

running (12.0s), 24/24 VUs, 14062 complete and 0 interrupted iterations
steady   [  80% ] 24 VUs  12.0s/15s

running (13.0s), 24/24 VUs, 15031 complete and 0 interrupted iterations
steady   [  87% ] 24 VUs  13.0s/15s

running (14.0s), 24/24 VUs, 16081 complete and 0 interrupted iterations
steady   [  93% ] 24 VUs  14.0s/15s

running (15.0s), 24/24 VUs, 17222 complete and 0 interrupted iterations
steady ↓ [ 100% ] 24 VUs  15s
time="2026-06-18T01:11:47+05:30" level=info msg="pprof load done (started 2026-06-17T19:41:31.920Z)" source=console


  █ THRESHOLDS 

    errors
    ✓ 'rate<0.05' rate=0.00%

    http_req_duration
    ✓ 'p(99)<5000' p(99)=120.4ms

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 34492   2280.407704/s
    checks_succeeded...: 100.00% 34492 out of 34492
    checks_failed......: 0.00%   0 out of 34492

    ✓ status is 200
    ✓ response has content

    CUSTOM
    active_latency.................: avg=9.466535   min=2        med=7      max=113      p(90)=17      p(95)=23      p(99)=37      
    errors.........................: 0.00%  0 out of 17246
    hft_latency....................: avg=171.803103 min=75       med=167.5  max=440      p(90)=229     p(95)=255.15  p(99)=330.63  
    pdf_generation_time............: avg=15.182999  min=1        med=5      max=440      p(90)=20      p(95)=64.5    p(99)=204     
    retail_latency.................: avg=6.768854   min=1        med=4      max=117      p(90)=14      p(95)=20      p(99)=38      

    HTTP
    http_req_duration..............: avg=10.98ms    min=457.19µs med=4.54ms max=344.26ms p(90)=18.86ms p(95)=48.23ms p(99)=120.4ms 
      { expected_response:true }...: avg=10.98ms    min=457.19µs med=4.54ms max=344.26ms p(90)=18.86ms p(95)=48.23ms p(99)=120.4ms 
    http_req_failed................: 0.00%  0 out of 17247
    http_reqs......................: 17247  1140.269966/s

    EXECUTION
    iteration_duration.............: avg=20.91ms    min=1.62ms   med=6.51ms max=560.49ms p(90)=22.23ms p(95)=71.07ms p(99)=292.19ms
    iterations.....................: 17246  1140.203852/s
    vus............................: 24     min=24         max=24
    vus_max........................: 24     min=24         max=24

    NETWORK
    data_received..................: 1.6 GB 108 MB/s
    data_sent......................: 1.1 GB 74 MB/s



running (15.1s), 00/24 VUs, 17246 complete and 0 interrupted iterations
steady ✓ [ 100% ] 24 VUs  15s